tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jakehilborn/jakehilborn"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Platform built on V8 to build network applications
brew "node"
# Command-line JSON processing tool
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Customized Bash environment for git work
brew "git-sh"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Sophisticated file transfer program
brew "lftp"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Trigger notifications when a process completes
brew "noti"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Terminal multiplexer
brew "tmux"
# Learn vim commands via a game
brew "pacvim"
# Show ps output as a tree
brew "pstree"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# User interface to the TELNET protocol
brew "telnet"
# Programatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew "jakehilborn/jakehilborn/displayplacer"
cask "alacritty"
cask "battle-net"
cask "bettertouchtool"
cask "caffeine"
cask "cryptomator"
cask "day-o"
cask "devdocs"
cask "discord"
cask "firefox"
cask "font-droid-sans-mono-for-powerline"
cask "font-droidsansmono-nerd-font"
cask "font-fira-code"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-victor-mono"
cask "foxitreader"
cask "franz"
cask "insync"
cask "kap"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "marshallofsound-google-play-music-player"
cask "marta"
cask "numi"
cask "omnidisksweeper"
cask "osxfuse"
cask "skitch"
cask "steam"
cask "sublime-text"
cask "vimr"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vv"
cask "workflowy"
cask "yt-music"
cask "ytmdesktop-youtube-music"
