tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bkt"
brew "coreutils"
brew "diff-so-fancy"
brew "entr"
brew "fortune"
brew "node"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "less"
brew "lesspipe"
brew "lftp"
brew "mas"
brew "moreutils"
brew "neovim"
brew "noti"
brew "nyancat"
brew "tmux"
brew "pstree"
brew "python"
brew "rbenv"
brew "ranger"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby-install"
brew "ssh-copy-id", link: true
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmuxinator"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "z"

cask "alacritty"
cask "bettertouchtool"
cask "caffeine"
cask "cryptomator"
cask "devdocs"
cask "font-droid-sans-mono-nerd-font"
cask "ferdium"
cask "kap"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keyboardcleantool"
cask "numi"
cask "omnidisksweeper"
cask "skitch"
cask "vimr"
cask "visual-studio-code"
cask "vivaldi"
cask "workflowy"
cask "yt-music"

mas "Monosnap", id: 540348655
mas "Hour - World Clock", id: 569089415
